Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་དགའ་བ་དང་བདེ་བ་མྱོང་མོད་ནོར་བཟངས་ཀྱིས་སྨྲས་པ་འཕགས་པ་དགེ་བའི་བཤེས་གཉེན་གྱི་བྱིན་གྱི་རླབས་དང་དགེ་བའི་བཤེས་གཉེན་གྱི་དགོངས་པ་དང་དགེ་བའི་བཤེས་གཉེན་གྱི་མཐུས་མཐོང་ངོ་། །
en: You have experienced the delight and bliss of the bodhisattva’s samādhi.” Sudhana said, “Ārya, I have seen them through the blessing of the kalyāṇamitra, through the intention of the kalyāṇamitra, and through the power of the kalyāṇamitra.

source: འཕགས་པ་རྣམ་པར་ཐར་པ་འདིའི་མིང་ཅི་ཞེས་བགྱི་སྨྲས་པ།
en: Ārya, what is this liberation called?”

source: རིགས་ཀྱི་བུ་རྣམ་པར་ཐར་པ་འདི་ནི་དུས་གསུམ་གྱི་དམིགས་པ་ཐམས་ཅད་ལ་ཤེས་པ་རབ་ཏུ་ཞུགས་པའི་དྲན་པ་ཉམས་པ་མེད་པས་བརྒྱན་པའི་སྙིང་པོ་ཞེས་བྱ་བ་སྟེ།
en: Maitreya answered, “Noble one, this liberation is called the essence of the display of the unfailing memory that engages with the knowledge of all objects of perception in the three times.

source: རིགས་ཀྱི་བུ་རྣམ་པར་ཐར་པ་འདི་ལྟ་བུ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་ནི་ཚེ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐོབ་བོ། །
en: “Noble one, this kind of liberation, which is inexpressibly inexpressible, is the attainment of a bodhisattva with one lifetime remaining.”

source: ནོར་བཟངས་ཀྱིས་སྨྲས་པ། འཕགས་པ་རྒྱན་དེ་དག་གང་དུ་མཆིས།
en: Sudhana asked, “Ārya, where is this display?”

source: སྨྲས་པ་གང་ནས་འོང་བ་དེར་རོ། །
en: The bodhisattva Maitreya answered, “It is where it comes from.”

source: ནོར་བཟངས་ཀྱིས་སྨྲས་པ་གང་ནས་མཆིས་སྨྲས་པ།
en: Sudhana asked, “Where does it come from?”

source: བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་བྱིན་གྱི་རླབས་མངོན་པར་བསྒྲུབས་པ་ལས་འོངས་སོ། །
en: The bodhisattva Maitreya answered, “It comes from the accomplishment of the blessing of the wisdom of a bodhisattva.

source: དེ་ནི་བྱིན་གྱི་རླབས་དེ་ཉིད་ལ་གནས་ཤིང་གང་དུ་ཡང་སོང་བ་མེད་ལ་འཕོས་པ་མེད་དོ། །
en: It dwells within that blessing. It does not come or go from anywhere.

source: ཕུང་པོར་གྱུར་པ་མེད་དོ། །
en: It does not accumulate.

source: ཚོགས་སུ་གྱུར་པ་མེད་དོ། །
en: It does not come together.

source: བརྩེགས་པར་གནས་པ་མེད་དོ། །
en: It does not amass.

source: དངོས་པོར་གནས་པ་མེད་དོ། །
en: It has no location as a thing.

source: ཡུལ་ན་གནས་པ་མ་ཡིན་ནོ། །
en: It has no location as an object of perception.

source: ཕྱོགས་ན་གནས་པ་མ་ཡིན་ནོ། །
en: It has no location in any direction.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ཀླུ་རྣམས་ཀྱི་སྤྲིན་གྱི་དྲ་བ་ནི་ལུས་ལ་ཡང་མི་གནས། སེམས་ལ་ཡང་མི་གནས་ནང་ལ་ཡང་མི་གནས་མོད་ཀྱི་ཀླུའི་སེམས་ཀྱི་དབང་དང་ཀླུའི་དབང་བསམ་གྱིས་མི་ཁྱབ་པས་ཆར་གྱི་རྒྱུན་ཚད་མེད་པ་བཀྱེ་བ་ནི་མེད་པ་མ་ཡིན་ཏེ་སྣང་ངོ་། །
en: “By analogy, noble one, the net of clouds of the nāgas is not located in the body, is not located in the mind, is not located internally, and yet through the power of a nāga’s mind and through the inconceivable power of a nāga there is emitted a measureless flow of rain, which is not nonexistent and appears.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་རྒྱན་དེ་དག་ཀྱང་ནང་ནའང་གནས་མ་ཡིན། ཕྱི་རོལ་ན་གནས་པ་ཡང་མ་ཡིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་བྱིན་གྱི་རླབས་ཀྱི་དབང་དང་། ཁྱོད་ཀྱི་སྣོད་བཟང་པོའི་ཕྱིར་མི་སྣང་བར་ཡང་མ་ཡིན་ནོ།
en: In the same way, noble one, those displays are not located internally and are not located externally, but they become visible through the power of a bodhisattva’s blessing and through your being a good vessel.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་མཁན་པོས་ནི་སྒྱུ་མའི་ཡུལ་ཐམས་ཅད་ཡོངས་སུ་བསྟན་ཀྱང་གང་ནས་ཀྱང་འོངས་པ་མེད་བཤིག་ཀྱང་གང་དུ་ཡང་འགྲོ་བ་མྱེད་དེ། འཕོ་བ་མྱེད་མོད་ཀྱི་སྔགས་དང་རྩིའི་མཐུས་ཡོངས་སུ་མི་སྣང་བ་མ་ཡིན་ནོ། །
en: “By analogy, noble one, a conjurer displays the entire range of illusions, but they do not come from anywhere, do not go anywhere, and are not transferred to anywhere, but through the power of mantra and concoctions, they are perceived.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་རྒྱན་དེ་དག་ཀྱང་གང་དུ་ཡང་སོང་བ་མེད། གང་ནས་ཀྱང་འོངས་པ་མེད་ལ་གང་དུའང་ཕུང་པོར་གྱུར་བ་མྱེད་མོད་ཀྱི། བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་སྒྱུ་མ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་ཤིན་ཏུ་བསླབས་པ་དང་། སྔོན་གྱི་སྨོན་ལམ་གྱི་བྱིན་གྱི་རླབས་དང་། ཡེ་ཤེས་ཀྱི་དབང་གིས་ཡོངས་སུ་མི་སྣང་བ་མ་ཡིན་ནོ། །
en: In the same way, noble one, those displays do not go anywhere, have not come from anywhere, and are not transferred anywhere, but they are perceived through having trained in the inconceivable wisdom conjurations of a bodhisattva and through the power of wisdom and the blessing of past prayers.”

source: ནོར་བཟངས་ཀྱིས་སྨྲས་པ། འཕགས་པ་ཤུལ་ཇི་སྲིད་ཅིག་ནས་གཤེགས་སྨྲས་པ།
en: Sudhana asked, “Ārya, from how far have you come?”

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འགྲོ་བ་ནི་འོང་བ་མེད་པར་འགྲོའོ། །གཡོ་བ་དང་གནས་པ་མེད་པར་འགྲོའོ། །
en: The bodhisattva Maitreya answered, “Noble one, the movement of bodhisattvas has no coming or going; their motion is without movement or stillness.

source: གནས་དང་བརྟེན་མེད་པར་འགྲོའོ། །
en: Their motion is without basis or location.

source: ཤི་འཕོ་དང་སྐྱེ་བ་མེད་པར་འགྲོའོ། །
en: Their motion is without passing away or rebirth.

source: གནས་པ་དང་འཕོ་བ་མེད་པར་འགྲོའོ། །
en: Their motion is without remaining or going elsewhere.

source: གཡོ་བ་དང་ལྡང་བ་མེད་པར་འགྲོའོ། །
en: Their motion is without movement or rising.

source: ལྟོས་པ་དང་གནས་མེད་པར་འགྲོའོ། །
en: Their motion is without dependence or location.

source: ལས་དང་རྣམ་པར་སྨིན་པ་མེད་པར་འགྲོའོ། །
en: Their motion is without karma or its ripening.

source: མྱི་སྐྱེ་བ་དང་མི་འགག་པར་འགྲོའོ། །
en: Their motion is without creation or cessation.

source: རྟག་པ་མེད་པ་དང་ཆད་པ་མེད་པར་འགྲོའོ། །
en: Their motion is without permanence or annihilation.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འགྲོ་བ་ནི་འདུལ་བའི་སེམས་ཅན་ལ་ལྟ་བས་སྙིང་རྗེ་ཆེན་པོའོ། །
en: “Moreover, noble one, the motion of bodhisattvas is great compassion because it observes beings to be guided.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འགྲོ་བ་ནི་སྡུག་བསྔལ་བའི་སེམས་ཅན་ཡོངས་སུ་སྐྱོབ་པས་བྱམས་པའོ། །
en: The motion of bodhisattvas is great love because it saves beings from suffering.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འགྲོ་བ་ནི་གང་དུ་དགའ་བར་སྐྱེ་བས་ཚུལ་ཁྲིམས་སོ།
en: The motion of bodhisattvas is correct conduct because it regards everyone kindly.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འགྲོ་བ་ནི་སྔོན་གྱི་བྱིན་གྱི་རླབས་ཀྱིས་སྨོན་ལམ་མོ། །
en: The motion of bodhisattvas is prayer because of the blessings of the past.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འགྲོ་བ་ནི་ཐམས་ཅད་དུ་བཞིན་ཡོངས་སུ་སྟོན་པས་མངོན་པར་ཤེས་པའོ། །
en: The motion of bodhisattvas is higher cognition because it manifests itself to all.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འགྲོ་བ་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ནས་གཡོ་བ་མེད་པས་མངོན་པར་འདུ་བྱ་བ་མེད་པའོ། །
en: The motion of bodhisattvas has no formation, as there is no movement from being at the feet of all the tathāgatas.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འགྲོ་བ་ནི་ལུས་དང་སེམས་ཡོངས་སུ་མི་གཏོང་བས་ལེན་པ་དང་འདོར་བ་མེད་པའོ། །
en: The motion of bodhisattvas has no acquisition or rejection, because it is not focused on a body or mind.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འགྲོ་བ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བས་ཤེས་རབ་དང་ཐབས་སོ། །
en: The motion of bodhisattvas is wisdom and method because it follows all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འགྲོ་བ་ནི་མིག་ཡོར་དང་གཟུགས་བརྙན་དང་། སྤྲུལ་པ་ལྟ་བུ་ཡིན་པས་སྤྲུལ་པ་ཡོངས་སུ་སྟོན་པའོ། །
en: The motion of bodhisattvas is the manifestation of emanations because it is like a mirage, a reflection, or an illusory manifestation.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཁྱོད་ལམ་ཇི་སྲིད་ཅིག་ནས་འོངས་ཤེས་ཁྱོད་ཀྱིས་སྨྲས་པ་ནི།
en: “Moreover, noble one, you asked, ‘From how far have you come?’

source: རིགས་ཀྱི་བུ་ང་ནི་ཚེའི་ས་ཡུལ་ཕྲེང་བ་སྟོབས་ཀྱི་གྲོང་རྡལ་ཁང་ཁྱིམ་ཅན་ཞེས་བྱ་བ་དེ་ན་ཚོང་དཔོན་ས་སྐྱོང་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: Noble son, I come here from a hamlet called Kuṭi in the land of the Māladas, which is the place of my birth. In that place there was a head merchant by the name of Gopālaka.

source: དེ་སངས་རྒྱས་ཀྱི་ཆོས་ལ་བཞག་ནས་ཚེའི་སའི་མི་རྣམས་ལ་སྣོད་ཀྱི་ཚུལ་བཞིན་དུ་ཆོས་བསྟན་པ་བྱས་ཏེ།
en: After I had established him in the Buddha’s Dharma, I taught the Dharma, in accordance with the nature of the recipients, to the people of my birthplace.

source: ཕ་མ་དང་བྲམ་ཟེ་དང་ཁྱིམ་བདག་དང་གཉེན་བཤེས་སུ་འོང་བ་རྣམས་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་བསྐུལ་ནས་འདིར་འོངས་སོ། །ནོར་བཟངས་ཀྱིས་སྨྲས་པ།
en: After I had inspired my parents, family, and relatives and brahmins and householders to enter the Mahāyāna, I came here.”

source: འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚེའི་ས་གང་ལགས།
en: Sudhana asked, “Ārya, where are the birthplaces of the bodhisattvas?”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚེའི་ས་སྟེ།
en: Maitreya replied, “Noble one, there are ten birthplaces of the bodhisattvas.

source: བྱང་ཆུབ་ཀྱི་སེམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རིགས་སུ་སྐྱེས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚེའི་སའོ། །
en: (1) “The aspiration to enlightenment is a birthplace of the bodhisattvas because it is birth into the family of bodhisattvas.

source: ལྷག་པའི་བསམ་པ་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་རིགས་སུ་སྐྱེས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚེའི་སའོ། །
en: (2) The higher motivation is a birthplace of the bodhisattvas because it is birth into the family of kalyāṇamitras.

source: ས་ལ་གནས་པ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རིགས་སུ་སྐྱེས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚེའི་སའོ། །
en: (3) Being upon the bhūmis is a birthplace of the bodhisattvas because it is birth into the family of the perfections.

source: སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་ནི་སྤྱོད་པའི་རིགས་སུ་སྐྱེས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚེའི་སའོ། །
en: (4) The accomplishment of prayer is a birthplace of the bodhisattvas because it is birth into the family of bodhisattva conduct.

source: སྙིང་རྗེ་ཆེན་པོ་ནི་བསྡུ་བའི་དངོས་པོ་ཐམས་ཅད་ཀྱི་རིགས་སུ་སྐྱེས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚེའི་སའོ། །
en: (5) Great compassion is a birthplace of the bodhisattvas because it is birth into the family of all the methods of gathering pupils.

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་རྟོགས་པར་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རིགས་སུ་སྐྱེས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚེའི་སའོ། །
en: (6) The correct realization of the nature of phenomena is a birthplace of the bodhisattvas because it is birth into the family of the perfection of wisdom.

source: ཐེག་པ་ཆེན་པོ་ནི་ཐབས་མཁས་པའི་རིགས་སུ་སྐྱེས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚེའི་སའོ། །
en: (7) The Mahāyāna is a birthplace of the bodhisattvas because it is birth into the family of skillful methods.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བ་བ་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་རིགས་སུ་སྐྱེས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚེའི་སའོ། །
en: (8) Ripening beings is a birthplace of the bodhisattvas because it is birth into the family of complete buddhahood.

source: ཐབས་དང་ཤེས་རབ་གཉིས་ནི་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པའི་རིགས་སུ་སྐྱེས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚེའི་སའོ། །
en: (9) Method and wisdom are a birthplace of the bodhisattvas because they are birth into the family of patience from the birthlessness of phenomena.

source: རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་ནི་འདས་པ་དང་མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་སུ་སྐྱེད་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚེའི་ས་སྟེ།
en: (10) Noble one, the practice of the Dharma is a birthplace of the bodhisattvas because it is birth into the family of all past, future, and present tathāgatas.

source: རིགས་ཀྱི་བུ་བཅུ་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚེའི་སའོ། །
en: Noble one, those ten are the birthplaces of the bodhisattvas.

source: རིགས་ཀྱི་བུ་ཐབས་མཁས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་མའོ། །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་འོ་མའོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་མ་མའོ། །བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ལྷབ་ལྷུབ་དང་རྒྱན་ཏོ། །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་བསྐྱེད་པའོ། །བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་སྤྱོད་པ་རྣམ་པར་དག་པར་བྱེད་པའོ། །དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བསླབ་པ་ལ་སྤྱོད་དུ་འཇུག་པའོ། །བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཐམས་ཅད་ནི་གྲོགས་པོའོ། །དགེ་བའི་རྩ་བའི་ཆོས་ཐམས་ཅད་ནི་གཉེན་བཤེས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ནི་ཕུ་ནུའོ། བྱང་ཆུབ་ཀྱི་སེམས་ནི་རིགས་སོ། །ནན་ཏན་ནི་རིགས་ཀྱི་ཆོས་སོ། །སའི་གནས་ནི་རིགས་ཀྱི་གནས་སོ། །བཟོད་པ་ཐོབ་པ་ནི་རིགས་སུ་རིགས་དང་ལྡན་པར་སྐྱེས་པའོ། །སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་ནི་རིགས་ཀྱི་གཞུང་ཐོབ་པའོ། །སྤྱོད་པ་རྣམ་པར་དག་པ་ནི་རིགས་ཀྱི་ཆོས་ཀྱི་རྗེས་སྙེགས་པའོ། །ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་བསྐུལ་བ་ནི་རིགས་ཀྱི་རྒྱུན་མི་གཅོད་པའོ། །དབང་བསྐུར་ནས་ཚེ་གཅིག་གིས་ཐོགས་པ་ནི་ཆོས་ཀྱི་རྒྱལ་པོའི་སྲས་ཀྱི་ཐུ་བོའོ། །དེ་བཞིན་གཤེགས་པ་ཉིད་དུ་ཡང་དག་པར་བསྒྲུབ་པ་ནི་རིགས་ཀྱི་རྒྱུད་ཡོངས་སུ་དག་པ་སྟེ། རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་བྱིས་པ་ཐ་དད་པའི་སྐྱེ་བོའི་ས་ལས་ཤིན་ཏུ་འདས་པ་ཡིན། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་པ་ཡིན། དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་ཡང་དག་པར་བྱུང་བ་ཡིན། དེ་བཞིན་གཤེགས་པའི་རྒྱུད་ལ་རབ་ཏུ་གནས་པ་ཡིན། དཀོན་མཆོག་གསུམ་གྱི་རིགས་རྒྱུན་མི་གཅད་པ་ལ་ཞུགས་པ་ཡིན། བྱང་ཆུབ་སེམས་དཔའི་རིགས་ཡོངས་སུ་བསྡུ་བ་ལ་མངོན་པར་བརྩོན་པ་ཡིན། རིགས་དང་རུས་ཀྱི་ཡོངས་སུ་དག་པ་ཡིན། མནད་ཀྱི་རྒྱུད་ཀྱི་སྨད་དུ་མེད་པ་ཡིན།
en: “Noble one, method and wisdom are the father of the bodhisattvas; the perfection of wisdom is their mother; the perfection of generosity is their wet nurse; the perfection of conduct is their nanny; the perfection of patience is their adornment and jewelry; the perfection of diligence is their growing up; the perfection of meditation is their correct conduct; the kalyāṇamitras are their training in conduct; all the aspects of enlightenment are their companions; all the qualities of the roots of merit are their friends; all the bodhisattvas are their brothers; the aspiration to enlightenment is their family; their practice is the qualities of their family; being upon the bhūmis is being in their family; attaining patience is being born into the family; accomplishing prayer is inheriting the knowledge of the family; pure conduct is gaining the qualities of the family; inspiring others to the Mahāyāna is maintaining the continuity of the family; being consecrated as having one life remaining is being the senior son of a Dharma king; and attaining becoming a tathāgata is purifying the lineage of the family.

source: ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དང་། བདུད་དང་བཅས་པ་དང་། ཚངས་པ་དང་བཅས་པ་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུའི་ནང་ན་རིགས་ལ་སྨོས་པའི་སྐྱོན་ཐམས་ཅད་ཀྱི་ཁ་ན་མ་ཐོ་བ་མྱེད་པ་ཡིན་ཏེ། སངས་རྒྱས་ཀྱི་རིགས་དམ་པར་སྐྱེས་ལ་སྨོན་ལམ་ཆེན་པོའི་ལུས་དང་ལྡན་པས་རིགས་ཀྱིས་བཙུན་པ་ཡིན་ནོ། །
en: “Noble one, in that way, the bodhisattvas transcend the level of different foolish beings; enter the faultlessness of a bodhisattva; enter the family of the tathāgatas; are within the lineage of the tathāgatas; practice to maintain the continuity of the family of the Three Jewels; are dedicated to protecting the family of the bodhisattvas; make the family and clan pure; do not cause the vital lineage to decline; have no fault of transgression in the family that could be criticized by any of the beings in the world including its devas, its māras, its Brahmā deities, and its śramaṇas and brahmins; and have the nobility of their family because through being born in the supreme family of the buddhas they possess a body of great prayer.

source: རིགས་ཀྱི་བུ་རྒྱུད་ཀྱི་རིགས་དེ་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཆོས་ཐམས་ཅད་གཟུགས་བརྙན་ལྟ་བུར་ཡོངས་སུ་ཤེས་པས་འཇིག་རྟེན་གྱི་སྐྱེ་གནས་ཐམས་ཅད་དུ་སྨད་པ་མེད་པ་ཡིན་ཏེ་སྲིད་པའི་སྐྱེ་གནས་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུར་ཡོངས་སུ་ཤེས་པས་སྲིད་པའི་ལམ་གྱི་རྒྱུད་དུ་སྐྱེ་ཞིང་གནས་པ་ཐམས་ཅད་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར་རོ།
en: “Noble one, the bodhisattvas who have such a family lineage know all phenomena to be like reflections, so they are not revolted by births in all worlds. Knowing that all births in existences are like magical illusions, they are born in and remain within the various modes of existence without being afflicted by them.

source: ཆོས་ཐམས་ཅད་ལ་བདག་མེད་པར་ཁོང་དུ་ཆུད་པའི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བས་ཡོངས་སུ་མི་སྐྱོའོ། །
en: They have comprehended the absence of a self in everything and therefore do not become wearied in ripening and guiding beings.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་ལུས་དང་ལྡན་པའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་གདགས་པར་ངལ་བར་མི་འགྱུར་རོ། །
en: They possess bodies of great love and great compassion and therefore do not become fatigued in benefiting beings.

source: འཁོར་བ་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུར་ཡོངས་སུ་རྟོགས་པས་བསྐུལ་པ་ཐམས་ཅད་དུ་གནས་པས་སྒྱིད་ལུག་པར་མི་འགྱུར་རོ། །
en: They have realized that all saṃsāra is like a dream and therefore do not become disheartened in remaining in it throughout all kalpas.

source: ཕུང་པོ་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུར་ཡོངས་སུ་ཤེས་པས་སྐྱེ་བ་དང་ཤི་འཕོ་བ་དང་འཆི་བ་ཡོངས་སུ་བསྟན་པ་ཐམས་ཅད་ཀྱིས་དུབ་པར་མི་འགྱུར་རོ། །
en: They know that all the skandhas are like conjured illusions, and therefore they are not made despondent by all manifestations of birth, passing away, and death.

source: ཁམས་དང་སྐྱེ་མཆེད་ཆོས་ཀྱི་དབྱིངས་ཀྱི་རང་བཞིན་དུ་རབ་ཏུ་རྟོགས་པས་ཡུལ་ཐམས་ཅད་ཀྱི་རྨ་མི་འབྱུང་ངོ་། །
en: They have realized the dhātus and āyatanas to have the nature of the realm of phenomena and are therefore not wounded by anything in the range of sensory possessions.

source: འདུ་ཤེས་ཀྱི་རྣམ་པ་ཐམས་ཅད་སྨིག་རྒྱུ་ལྟ་བུར་ཤིན་ཏུ་བསྒོམས་པས་འཁོར་བའི་དགའ་བ་ཐམས་ཅད་ཀྱིས་མོས་པར་མི་འགྱུར་རོ། །
en: They meditate on all forms of perception as being like mirages and therefore have no aspiration for any of the joys of saṃsāra.

source: སྒྱུ་མ་ལྟ་བུའི་ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་བརྩེ་བས་བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་ཀྱིས་མི་དོགས་སོ། །
en: They play with all phenomena as being like conjured illusions and therefore are unstained by any scope of the māras.

source: ཆོས་ཀྱི་ལས་སུ་བྱུང་བས་ཉོན་མོངས་པ་ཐམས་ཅད་དུ་སྨོས་སུ་མེད་དོ། །
en: They have Dharma bodies and therefore are not brought down by the kleśas.

source: སྐྱེ་བ་ལ་དབང་རབ་ཏུ་ཐོབ་པས་འགྲོ་བའི་རྒྱུད་ཐམས་ཅད་རྟོགས་པར་ཁོང་དུ་ཆུད་པ་ཡིན་ནོ། །
en: And they have attained power over rebirth and therefore realize and comprehend all classes of existence.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ང་ནི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སྐྱེ་གནས་ཀྱི་ཁོངས་སུ་ཆུད་པའི་ལུས་དང་འགྲོ་བ་ཐམས་ཅད་ཀྱི་གཟུགས་དང་མཉམ་པའི་ཁ་དོག་གི་ཁྱད་པར་དང་སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་པའི་ངེས་པའི་ཚིག་གི་བྱེ་བྲག་དང་། འགྲོ་བ་ཐམས་ཅད་དང་མཉམ་པའི་མྱིང་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མོས་པ་དང་མཉམ་པའི་སྤྱོད་ལམ་དང་འགྲོ་བ་རྣམ་པར་གདུལ་བ་ཐམས་ཅད་དང་མཉམ་པའི་འཇིག་རྟེན་གྱི་རྗེས་སུ་འབྲང་བ་དང་། སེམས་ཅན་རྣམ་པར་དག་པར་བྱ་བ་ཐམས་ཅད་དང་མཉམ་པའི་ཚེ་དང་། རིགས་སུ་སྐྱེ་བ་ཡོངས་སུ་བསྟན་པ་དང་། བྱིས་པའི་སྤྱོད་པ་ཐམས་ཅད་དང་མཉམ་པའི་བྱ་བ་ལ་འཇུག་པའི་སྒོ་དང་། སེམས་ཅན་གྱི་འདུ་ཤེས་ཀྱི་རྣམ་པ་ཐམས་ཅད་དང་མཉམ་པའི་ཡོངས་སུ་ཤེས་པར་བྱ་བ་ལ་འཇུག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་སྤྲུལ་པ་ཐམས་ཅད་དང་མཉམ་པའི་ལུས་ཡོངས་སུ་བསྟན་ཅིང་བརྗོད་པས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ།
en: “Noble son, in that way, I have spread throughout the realm of phenomena with a body that enters birth in all world realms, with the particular appearances that are congruent with the forms of all beings, with specific definitions that are congruent with all beings, with various names that are congruent with all beings, with conduct that is congruent with the aspirations of all beings, with a conformity to worlds that is congruent with guiding all beings, with the manifestations of lifespans and births in families that are congruent with the beings who are to be purified, with gateways of entry into activities that are congruent with all the conducts of foolish beings, with an engagement in knowledge that is congruent with all the forms of perception of beings, and with the manifestations and splendor of bodies that are congruent with all the emanations from the prayers of bodhisattvas.

source: སྔོན་སྐལ་བ་མཉམ་པར་སྤྱོད་སྤྱོད་པའི་སེམས་ཅན་བྱང་ཆུབ་ཀྱི་སེམས་སྟོར་བར་གྱུར་པ་རྣམས་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། འཛམ་བུའི་གླིང་དུ་སྐྱེས་པའི་ཚེ་ཡོངས་སུ་བསྟན་པ་དང་། ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདིའི་ཡུལ་ཕྲེང་བ་སྟོབས་ཀྱི་གྲོང་རྡལ་ཁང་ཁྱིམ་དང་ལྡན་པ་ཞེས་བྱ་བ་འདིའི་བྲམ་ཟེའི་རིགས་སུ་སྐྱེས་པ་རྣམས་དང་།
en: “Noble one, in order to ripen those beings who in the past practiced in the same way as I did but lost aspiration for enlightenment, and in order to manifest a birth and life in Jambudvīpa, I was born in the brahmin castes in this hamlet called Kuṭi in the lands of the Māladas in this southern region.

source: ཕ་མ་དང་གཉེན་བཤེས་སུ་འོང་བ་རྣམས་རྣམ་པར་གདུལ་བ་དང་། བྲམ་ཟེའི་རིགས་དང་། རྒྱུད་ཀྱི་ཁྱད་པར་གྱིས་རིགས་ཀྱི་ང་རྒྱལ་ཅན་དུ་གྱུར་པ་འདི་དག་ང་རྒྱལ་ཅན་དུ་གྱུར་པ་འདི་དག་ང་རྒྱལ་མྱེད་པར་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་བསྐྱེད་པའི་དོན་དུ་འདིར་སྐྱེས་སོ། །
en: I was born here so as to guide my father, mother, family, and relatives, to dispel arrogance among those in the particular brahmin castes who were proud of their birth into those castes, and so that they would be born in the family of the tathāgatas.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ང་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ན་ཐབས་རྣམ་པ་འདི་ལྟ་བུས་སེམས་ཅན་བསམ་པའི་ཚུལ་ཇི་ལྟ་བུ་དང་ལྡན་པ་དང་། རྣམ་པ་ཇི་ལྟ་བུར་འདུལ་བ་རྣམས་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བ་བྱེད་ཅིང་ཁང་པ་བརྩེགས་པ་ཆེན་པོ་རྣམ་པར་སྣང་མཛད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་སྙིང་པོ་འདི་ན་འདུག་གོ །
en: “Noble one, in that way, I dwell in this Vairocana­vyūhālaṃkāra­garbha kūṭāgāra here in this southern region, ripening and guiding beings in whatever way is necessary and according to their aspirations through these kinds of methods.

source: འདི་ནས་ང་ཤི་འཕོས་ནས་ཀྱང་བསམ་པའི་ཚུལ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་རྣམས་ཀྱི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། དགའ་ལྡན་གྱི་རིགས་སུ་གཏོགས་པའི་ལྷའི་བུ་སྐལ་བ་མཉམ་པར་སྤྱོད་སྤྱོད་པ་རྣམས་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། འདོད་པའི་ཁམས་ནས་ཡོངས་སུ་འདས་པ་ཐམས་ཅད་ལ་འང་བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་དང་ཡེ་ཤེས་དང་། སྤྲུལ་པའི་རྒྱན་ཡོངས་སུ་བསྟན་པ་དང་། འདོད་པའི་དགའ་བའི་སྲེད་པ་ལས་རྣམ་པར་བཟློག་པ་དང་། འདུ་བྱེད་ཐམས་ཅད་མྱི་རྟག་པ་ཉིད་དུ་བསྟན་པ་དང་། ལྷར་སྐྱེས་པ་ཐམས་ཅད་ཀྱང་མཐར་གུད་པར་གྱུར་པ་ཡོངས་སུ་བསྟན་པ་དང་། ཡེ་ཤེས་ཆེན་པོའི་ཆོས་ཀྱི་སྒོ་འཆི་འཕོའི་རྣམ་པ་ཞེས་བ་བ་ཚེ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་ཡང་དག་པར་བགྲོ་བར་བྱ་བ་དང་། ལྷན་ཅིག་ཡོངས་སུ་སྨིན་པར་གྱུར་པ་རྣམས་དེར་སྐྱེ་བར་ཡོངས་སུ་བསྡུ་བར་བྱ་བ་དང་།
en: “When I die and pass away from here, I will manifest taking birth in the Tuṣita paradise in order to take care of beings in accordance with their aspirations; in order to ripen the Tuṣita devas whose conduct accords with mine; in order to manifest a bodhisattva’s merit, wisdom, and display of miracles to all those who have transcended the realm of desire; in order to dispel craving for desired pleasures; in order to teach the impermanence of all that is composite; in order to teach their eventual decline to all those who have been born as devas; in order to discuss, together with bodhisattvas who have one lifetime remaining, the Dharma gateway to great wisdom; in order to gather together those born there who have been ripened together with me; and in order to cause the lotuses of the guidance sent forth by the Tathāgata Śākyamuni to blossom.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བཀྱེ་བའི་འདུལ་བའི་པད་མོ་རྣམས་ཀྱང་ཁ་དབྱེ་བའི་ཕྱིར་དགའ་ལྡན་གྱི་གནས་སུ་སྐྱེ་བ་ཡོངས་སུ་སྟོན་ཏེ། དུས་ལ་བབ་པ་ལ་བསམ་པ་ཡོངས་སུ་རྫོགས་ནས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་ཐོབ་པར་བྱེད་ཀྱིས།
en: When the time has come for my intentions to be fulfilled, I will set out to attain omniscience, and when I have attained enlightenment, you will see me again, together with the kalyāṇamitra Mañjuśrī.

source: ངས་བྱང་ཆུབ་ཐོབ་ནས་ཀྱང་རིགས་ཀྱི་བུ་ཁྱོད་དང་།
en: “Depart, noble one.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པར་བཅས་པས་ད་དུང་ཡང་མཐོང་བར་འགྱུར་རོ། །
en: Go again into the presence of the bodhisattva Mañjuśrī and ask him, ‘How should bodhisattvas train in bodhisattva conduct?

source: སོང་རིགས་ཀྱི་བུ་ད་དུང་ཡང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་།
en: How should they practice it?

source: ཇི་ལྟར་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ལ་འཇུག་པར་བྱ་བ་དང་།
en: How should they comprehend the field of completely good conduct?

source: ཇི་ལྟར་མངོན་པར་བསྒྲུབ་པ་དང་།
en: How should they accomplish it?

source: ཇི་ལྟར་སྨོན་པར་བྱ་བ་དང་།
en: How should they pray for it?

source: ཇི་ལྟར་ཡོངས་སུ་སྦྱང་བར་བྱ་བ་དང་།
en: How should they master it?

source: ཇི་ལྟར་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་།
en: How should they enter it?

source: ཇི་ལྟར་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དྲིས་ཤིག་དང་།
en: How should they perfect it?’

source: དགེ་བའི་བཤེས་གཉེན་དེས་ཁྱོད་ལ་སྟོན་པར་འགྱུར་རོ།
en: Then that kalyāṇamitra will teach you.
